package by.academy.homework2;

//Задание 4. Создать иерархию классов, описывающих банковские карточки.
//Иерархия должна иметь хотя бы три уровня. 
public class Task4BankCard1 {
	public String nameCart = "Normal_Card";
	int term = 2;

	public String toString() {
		System.out.println("sdf");
		System.out.println("Данные по BankCard2: " + nameCart + " " + term + " года.");
		return "";
	}

}
